/******************************************************************************/
/*                                                                            */
/*              Ostfalia Hochschule für angewandte Wissenschaften             */
/*                        Fakultät für Fahrzeugtechnik                        */
/*           Institut für Fahrzeuginformatik und Fahrzeugelektronik           */
/*                             Fahrzeuginformatik                             */
/*                                                                            */
/* Paket:        MPT_LAB                                                      */
/*                                                                            */
/* Modul:        MPT_LAB_1                                                    */
/*                                                                            */
/* Beschreibung: Aufgaben 1.MPT-Labor                                         */
/*                                                                            */
/* Funktionen:   A_1_3: LED-Lauflicht                                         */
/*                                                                            */
/* Version:      1.0 / 120716 / V. v. Holt                                    */
/*                                                                            */
/******************************************************************************/

//------------------------------------------------------------------------------
//  Headerdateien
//------------------------------------------------------------------------------
// Allgemeine Headerdateien
#include <avr/io.h>

// Eigene Headerdateien
#include "MPT_LAB_MAIN.h"


#ifndef ENABLE_LSG
#ifdef ENABLE_A_1
#ifdef ENABLE_A_1_3
//------------------------------------------------------------------------------
//  Makro-/Konstantendefinitionen
//------------------------------------------------------------------------------


//------------------------------------------------------------------------------
//  Private Variablen
//------------------------------------------------------------------------------
	
	
//------------------------------------------------------------------------------
//  Interrupt Service Routinen
//------------------------------------------------------------------------------


//------------------------------------------------------------------------------
//  Private Funktionen
//------------------------------------------------------------------------------
void A_1_3_Wait_x_ms(uint16_t x_ms)
{
  // IHR_CODE_HIER ... => verwenden Sie Ihren Code aus A_1_2
  const uint16_t loopTime1 = 726;
  
  uint16_t i_w1;
  
  for(uint16_t i = 0; i < x_ms; i++){
	  for (i_w1 = 0; i_w1 < loopTime1; i_w1++)
	  {
	  }
  }
}


//------------------------------------------------------------------------------
//  Public Funktionen
//------------------------------------------------------------------------------
//------------------------------------------------------------------------------
// Aufgabe A_1_3: LED-Lauflicht
// Aufgabe A_1_3_1: Lauflicht L-R-L-... "Knightrider"
//------------------------------------------------------------------------------

//##############################################################################

// Aufgabe A_1_3_1: Lauflicht L-R-L-... "Knightrider"
void A_1_3_1(void)
{
  // IHR_CODE_HIER ...
  DDRC = 0xff;
  
 PORTC = 0xff;
 PORTC = ~(1);
 A_1_3_Wait_x_ms(1);
 
 while(1){
	 for(uint8_t i_p = 1; i_p < 8; i_p++){
		 PORTC = ~(1 << i_p);
		 A_1_3_Wait_x_ms(1);
	 }
	 
	 for(uint8_t i_p = 1; i_p < 8; i_p++){
		 PORTC = ~(0b10000000 >> i_p);
		 A_1_3_Wait_x_ms(1);
	 }
 }
}

//##############################################################################

#endif /* ENABLE_A_1_3 */
#endif /* ENABLE_A_1 */
#endif /* ENABLE_LSG */

/*
 *  EoF
 */
